# 2.Problem Statement
It happens all the time: someone gives you data containing malformed strings,
Python, lists and missing data. How do you tidy it up so you can get on with the
analysis?
Take this monstrosity as the DataFrame to use in the following puzzles:

In [83]:
import numpy as np
import pandas as pd

In [84]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [85]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

# 1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [86]:
df[df['FlightNumber'].isnull()]

          From_To  FlightNumber RecentDelays            Airline
1    MAdrid_miLAN           NaN           []  <Air France> (12)
3  Budapest_PaRis           NaN         [13]     12. Air France

In [87]:
df['FlightNumber'].isnull().sum()

2

In [88]:
df[df['FlightNumber'].isnull()==True]

          From_To  FlightNumber RecentDelays            Airline
1    MAdrid_miLAN           NaN           []  <Air France> (12)
3  Budapest_PaRis           NaN         [13]     12. Air France

In [89]:
df['FlightNumber'].isnull

<bound method Series.isnull of 0    10045.0
1        NaN
2    10065.0
3        NaN
4    10085.0
Name: FlightNumber, dtype: float64>

In [90]:
null_index = np.where(df['FlightNumber'].isnull()==True)

In [91]:
null_index

(array([1, 3], dtype=int64),)

In [92]:
null_index[0]

array([1, 3], dtype=int64)

In [93]:
for i in range(len(df)):
    if (df['FlightNumber'].iloc[i] == 'NaN'):
        print(i)

In [94]:
type(df['FlightNumber'].iloc[1])

numpy.float64

In [95]:
df['FlightNumber'].fillna(0,inplace=True)
for i in range(len(df)):
    if df['FlightNumber'].iloc[i] == 0:
        df['FlightNumber'].iloc[i] = df['FlightNumber'][i-1]+10
        
df['FlightNumber'] = df['FlightNumber'].astype(int)

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  iloc._setitem_with_indexer(indexer, value)

In [96]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [97]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [98]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [99]:
temp_data = df['From_To'].str.split("_",expand=True)

In [100]:
temp_data.rename(columns = {0:'From', 1:'To'}, inplace = True)

In [101]:
temp_data

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [102]:
temp_data['From']=temp_data['From'].str.title()
temp_data['To']=temp_data['To'].str.title()

In [103]:
temp_data

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

In [104]:
df.drop('From_To',axis=1,inplace=True)

In [105]:
df

   FlightNumber  RecentDelays              Airline
0       10045.0      [23, 47]               KLM(!)
1           NaN            []    <Air France> (12)
2       10065.0  [24, 43, 87]  (British Airways. )
3           NaN          [13]       12. Air France
4       10085.0      [67, 32]          "Swiss Air"

In [106]:
df[['From','To']]=temp_data

In [107]:
df

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    London      Paris
1           NaN            []    <Air France> (12)    Madrid      Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London  Stockholm
3           NaN          [13]       12. Air France  Budapest      Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels     London

In [173]:
counter = 0

for i in range(len(df)):
    if len(df['RecentDelays'].iloc[i])>counter:
        counter = len(df['RecentDelays'].iloc[i])
    
print(counter)

3

In [197]:
for i in range(len(df)):
    for j in range(counter):
        df['Delays_' + str(j)] = df['RecentDelays'].loc[i][j]

IndexError: list index out of range

In [233]:
for i in range(len(df)):
    counter = len(df['RecentDelays'].iloc[i])
    print(counter)
    for j in range(counter):
        if j > counter:
            break
        print(i,j)
        df['RecentDelays '+str(j)]=(df['RecentDelays'].iloc[i][j])

2
0 0
0 1
0
3
2 0
2 1
2 2
1
3 0
2
4 0
4 1

In [236]:
df['RecentDelays'].str.split(',',expand=True)

    0
0 NaN
1 NaN
2 NaN
3 NaN
4 NaN

In [204]:
counter=len(df['RecentDelays'].iloc[
counter

2

In [253]:
df.drop(['RecentDelays 0', 'RecentDelays 1', 'RecentDelays 2'],axis=1,inplace=True)

In [254]:
df.columns

Index(['FlightNumber', 'RecentDelays', 'Airline', 'From', 'To', 'Delay_0',
       'Delay_1', 'Delay_2'],
      dtype='object')

In [165]:
test = df['RecentDelays']

In [169]:
a = [23, 47]

In [170]:
a

[23, 47]

In [247]:
pd.DataFrame(df["RecentDelays"].str.split(',').fillna('[]').tolist())

    0
0  []
1  []
2  []
3  []
4  []

In [251]:
df[['Delay_0', 'Delay_1','Delay_2']] = pd.DataFrame(df["RecentDelays"].to_list(), columns=['Delay_0', 'Delay_1','Delay_2'])

In [252]:
df

,FlightNumber,RecentDelays,Airline,From,To,RecentDelays 0,RecentDelays 1,RecentDelays 2,Delay_0,Delay_1,Delay_2
0,10045.0,"[23, 47]",KLM(!),London,Paris,67,32,87,23.0,47.0,NaN
1,NaN,[],<Air France> (12),Madrid,Milan,67,32,87,NaN,NaN,NaN
2,10065.0,"[24, 43, 87]",(British Airways. ),London,Stockholm,67,32,87,24.0,43.0,87.0
3,NaN,[13],12. Air France,Budapest,Paris,67,32,87,13.0,NaN,NaN
4,10085.0,"[67, 32]","""Swiss Air""",Brussels,London,67,32,87,67.0,32.0,NaN